Repository: proyectosinf/PracticAPP
Catalog: iOS/Modules/Sources/AppCommon/Localizables/*.lproj/general.strings
Languages: es

# common_language_code
source: en
es: es

# common_cancel_text
source: Cancel
es: Cancelar

# common_close_text
source: Close
es: Cerrar

# common_accept_text
source: Accept
es: Aceptar

# common_done_text
source: Done
es: Hecho

# common_back_text
source: Back
es: Atrás

# common_continue_text
source: Continue
es: Continuar

# common_save_text
source: Save
es: Guardar

# common_edit_text
source: Edit
es: Editar

# common_yes_text
source: Yes
es: Sí

# common_default_server_error_text
source: An error occurred. Please try again.
es: Se ha producido un error. Por favor, inténtalo de nuevo.

# common_forgot_password_success_title_text
source: Sent mail
es: Correo enviado

# common_forgot_password_success_message_text
source: We've sent an email to %@ with instructions on how to reset your password. If you don't receive it within a few minutes, please check your spam folder.
es: Hemos enviado un correo a %@ con instrucciones para restablecer tu contraseña. Si no lo recibes en unos minutos, revisa tu carpeta de spam.

# common_loading_text
source: Loading...
es: Cargando...

# common_mandatory_text
source: Mandatory
es: Requerido

# common_show_password_a11y
source: Show password
es: Mostrar contraseña

# common_hide_password_a11y
source: Hide password
es: Ocultar contraseña

# common_force_to_update_text
source: There is a new version available. Update to have the best possible experience.
es: Hay una nueva versión disponible. Actualiza para tener la mejor experiencia posible.

# common_optional_update_text
source: There is a new version available. We recommend updating to have the best possible experience.
es: Hay una nueva versión disponible. Te recomendamos actualizar para tener la mejor experiencia posible.

# common_update_app_text
source: Update app
es: Actualizar app

# common_update_button
source: Update
es: Actualizar

# common_open_app_settings_text
source: Settings
es: Ajustes

# common_mandatory_placeholder_text
source: (Mandatory)
es: (Requerido)

# common_menu_job_offers_label_text
source: Job offers
es: Ofertas

# common_menu_company_label_text
source: Company
es: Empresa

# common_menu_candidacies_label_text
source: My candidacies
es: Mis candidaturas

# common_unauthorized_error_text
source: Your session has expired. Please log in again.
es: Tu sesión ha caducado. Por favor, inicia sesión de nuevo.

# login_password_text
source: Password
es: Contraseña

# login_welcome_body_text
source: Your practices App
es: Tu App de prácticas

# login_forgot_password_button
source: Forgot password?
es: ¿Contraseña olvidada?

# login_sign_up_text
source: Don’t you have an account yet?
es: ¿Aún no tienes una cuenta?

# login_error_credentials_text
source: Invalid email or password
es: Email o contraseña incorrectos

# login_forgot_password_title_text
source: Forgot your password?
es: ¿Has olvidado tu contraseña?

# login_password_subtitle_text
source: Enter your email address and we'll send you a link to reset it.
es: Introduce tu correo electrónico y te enviaremos un enlace para restablecerla.

# login_password_send_text
source: Send link
es: Enviar enlace

# login_password_nav_title_text
source: Recovered password
es: Recuperar contraseña

# login_try_later_text
source: We couldn't log you in. Please try again later.
es: No se pudo iniciar sesión. Inténtalo más tarde.

# logout_confirmation_title_text
source: Logout
es: Cerrar sesión

# logout_confirmation_message_text
source: Are you sure you want to log out?
es: ¿Seguro que quiere cerrar sesión?

# logout_confirm_button
source: Logout
es: Cerrar sesión

# logout_cancel_button
source: Cancel
es: Cancelar

# register_title_text
source: Register
es: Registro

# register_password_label_text
source: Password
es: Contraseña

# register_confirm_password_label_text
source: Repeat password
es: Repetir contraseña

# register_name_label_text
source: Name
es: Nombre

# register_lastname_label_text
source: Last name
es: Apellidos

# register_role_label_text
source: Role
es: Rol

# register_role_student_text
source: Student
es: Estudiante

# register_role_tutor_text
source: Work tutor
es: Tutor Laboral

# register_security_code_label_text
source: Security code
es: Código de seguridad

# register_social_security_label_text
source: Social Security Number
es: Número de Seguridad Social

# register_upload_pdf_button_button
source: Upload PDF
es: Subir PDF

# register_contact_name_label_text
source: Contact name
es: Nombre de contacto

# register_contact_phone_label_text
source: Contact phone
es: Teléfono de contacto

# register_send_button_button
source: Register
es: Registrarse

# register_invalid_email_text
source: Invalid email
es: Email inválido

# register_invalid_password_text
source: Password must be at least 8 characters, uppercase, lowercase and special characters
es: La contraseña debe tener al menos 8 caracteres, mayúsculas, minúsculas y caracteres especiales

# register_passwords_not_match_text
source: Passwords do not match
es: Las contraseñas no coinciden

# register_invalid_dni_text
source: Invalid DNI
es: DNI inválido

# register_invalid_social_security_text
source: Invalid Social Security Number
es: Número de Seguridad Social inválido

# register_security_code_required_text
source: Security code is required
es: El código de seguridad es obligatorio

# register_name_required_text
source: Name is required
es: El nombre es obligatorio

# register_lastname_required_text
source: Last name is required
es: El apellido es obligatorio

# register_contact_email_label_text
source: Contact Email
es: Email de contacto

# register_role_required_text
source: Role is required
es: El rol es obligatorio

# register_statement_text
source: ¡Welcome to PracticApp!
es: ¡Bienvenido a PracticApp!

# register_sub_statement_text
source: Sign up to start searching for internships
es: Regístrate para comenzar a buscar prácticas

# register_error_email_exists_text
source: The email address is already registered
es: El correo electrónico ya está registrado

# register_max_length_name_surname_text
source: Maximum 100 characters allowed.
es: Máximo 100 caracteres permitidos.

# register_invalid_phone_text
source: The phone number must have 9 characters
es: El número de teléfono tiene que tener 9 caracteres

# register_register_success_1_text
source: Successful registration
es: Registro exitoso

# register_register_success_2_text
source: You have successfully registered.
es: Te has registrado correctamente.

# register_validation_error_text
source: Validation Error
es: Error de validación

# register_fields_completed_text
source: Please fill in all fields correctly.
es: Completa correctamente todos los campos.

# register_register_try_again_text
source: Registration could not be completed. Please try again.
es: No se pudo completar el registro. Inténtalo de nuevo.

# register_error_firebase_user_null_text
source: Could not get Firebase user
es: No se pudo obtener el usuario de Firebase

# register_error_firebase_token_text
source: Could not get Firebase token
es: No se pudo obtener el token de Firebase

# register_error_by_role_null_text
source: Unknow role
es: Rol desconocido

# register_error_dni_already_exists_text
source: A student already exists with that DNI
es: Ya existe un estudiante con ese DNI

# register_error_role_null_text
source: You must select a role
es: Debes seleccionar un rol

# home_title_text
source: Homes
es: Home

# home_attach_photo_button
source: Attach photo
es: Adjuntar foto

# home_attach_photo_dialog_button
source: Attach photo (with permission dialog)
es: Adjuntar foto (con diálogo de permisos)

# home_camera_rationale
source: A camera permit is required to take pictures.
es: Es necesario el permiso de cámara para tomar fotos.

# home_camera_rejected_permission
source: You must give camera permission to the app in order to attach photos.
es: Debes dar permiso de cámara a la app para poder adjuntar fotos.

# about_button
source: Start resource that needs multiple permissions
es: Iniciar recurso que necesita múltiples permisos

# about_multiple_permissions_rationale
source: Camera and microphone permissions are required for X.
es: Son necesarios los permisos de cámara y micrófono para X.

# about_multiple_permissions_rejected
source: You must allow camera and microphone permissions for the app to X.
es: Debes dar permisos de cámara y micrófono a la app para X.

# candidacy_loading_text
source: Loading candidacies...
es: Cargando candidaturas...

# candidacy_not_candidacy_text
source: Not candidacies
es: No hay candidaturas

# candidacy_not_candidacy_info_text
source: This offer has no registered candidates.
es: Esta oferta no tiene ninguna candidatura registrada.

# candidacy_postulation_text
source: Inscription date:
es: Fecha de inscripción:

# candidacy_status_text
source: Status:
es: Estado:

# candidacy_title_text
source: Candidacies
es: Candidaturas

# candidacy_my_tittle_text
source: My candidacies
es: Mis candidaturas

# candidacy_status_pending_text
source: Pending
es: Pendiente

# candidacy_status_accepted_text
source: Accepted
es: Aceptada

# candidacy_status_rejected_text
source: Rejected
es: Rechazada

# candidacy_list_previous_button
source: Previous
es: Anterior

# candidacy_presentation_card_text
source: Presentation card:
es: Carta de presentación:

# candidacy_register_text
source: Sing up
es: ¡Inscríbete!

# candidacy_success_text
source: Success
es: Éxito

# candidacy_singup_success_text
source: Registration completed successfully.
es: Inscripción completada con éxito.

# candidacy_register_error_text
source: The registration could not be completed.
es: No se ha podido realizar la inscripción

# candidacy_type_presentation_card_text
source: Type here...
es: Escribe aquí...

# candidacy_list_next_button
source: Next
es: Siguiente

# candidacy_title_detail_text
source: Candidacy detail
es: Detalle de candidatura

# candidacy_additional_note_hint_text
source: Additional note (optional)
es: Nota adicional (opcional)

# candidacy_additional_note_text
source: Additional note
es: Nota adicional

# candidacy_accept_button
source: Accept
es: Aceptar

# candidacy_reject_button
source: Reject
es: Rechazar

# candidacy_dialog_accept_title_text
source: Accept candidacy?
es: ¿Aceptar candidatura?

# candidacy_dialog_reject_title_text
source: Reject candidacy?
es: ¿Rechazar candidatura?

# candidacy_dialog_accept_confirm_button
source: Accept
es: Aceptar

# candidacy_dialog_reject_confirm_button
source: Reject
es: Rechazar

# candidacy_dialog_confirm_button
source: Confirm
es: Confirmar inscripción

# candidacy_dialog_cancel_button
source: Cancel
es: Cancelar

# candidacy_company_comment_text
source: Company comment
es: Comentario de la empresa

# candidacy_update_candidacy_text
source: Updated Candidacy
es: Candidatura actualizada

# candidacy_reject_candidacy_alert_text
source: You have successfully rejected the student
es: Haz rechazado al alumno correctamente

# candidacy_acept_candidacy_alert_text
source: You have successfully accepted the student
es: Has aceptado al alumno correctamente

# candidacy_confirm_register_text
source: Confirm register
es: Confirmar

# candidacy_question_text
source: Want
es: Quieres

# candidacy_question_to_text
source: to
es: a

# candidacy_register_question_text
source: Do you want to sign up for this offer?
es: ¿Quieres inscribirte en esta oferta?

# candidacy_inscriptions_text
source: Enrolled:
es: Inscritos:

# company_welcome_message_text
source: To get started register a company
es: Para comenzar registra una empresa

# company_url_not_valid_text
source: Invalid url
es: Url no válida

# company_cif_valid_format_text
source: The CIF must be a valid format
es: El CIF debe tener un formato válido

# company_register_success_1_text
source: Registered Company
es: Empresa Registrada

# company_register_success_2_text
source: The company has been registered successfully
es: La empresa se ha registrado correctamente

# company_register_failure_title_text
source: Register error
es: Error en el registro

# company_register_failure_message_text
source: The company has not been registered successfully
es: La empresa no se ha registrado correctamente

# company_incomplete_fields_text
source: Incomplete fields
es: Campos incompletos

# company_mandatory_fields_text
source: Fill in the required fields
es: Rellena los campos obligatorios

# company_name_label_text
source: Company name
es: Nombre de la empresa

# company_company_tab_text
source: Company
es: Empresa

# company_create_button
source: Create company
es: Crear empresa

# company_view_company_title_text
source: My Company
es: Mi Empresa

# company_view_company_subtitle_text
source: Company info
es: Información de la empresa

# company_logout_text_text
source: Logout
es: Cerrar Sesión

# company_my_company_label_text_text
source: My Company
es: Mi Empresa

# company_loading_company_text
source: Loading Company...
es: Cargando empresa...

# company_companyreg1_text
source: To get started
es: Para comenzar

# company_companyreg2_text
source: register a company
es: registra un empresa.

# company_areyousure_text
source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres cerrar sesión?

# company_logo_content_description_text
source: Company logo
es: Logo de la empresa

# company_view_company_load_error_text
source: Failed to retrieve company information
es: Formation:

# company_register_error_name_or_cif_exists_text
source: A company already exists with that name or CIF
es: Ya existe una empresa con ese nombre o CIF

# company_update_logo_text
source: Update Logo
es: Logo actualizado

# company_update_logo_success_text
source: The image has been uploaded successfully
es: La imagen se ha subido correctamente.

# company_upload_logo_text
source: Upload Logo
es: Subir imagen

# company_logo_upload_error_text
source: Upload error
es: Error al subir la imagen

# offer_enter_title_text
source: Enter tittle
es: Introduce un título

# offer_description_offer_text
source: Offer description
es: Describe la oferta

# offer_example_vacancy_text
source: Ex: 3
es: Ej: 3

# offer_enter_address_text
source: Enter address
es: Introduce dirección

# offer_example_cp_text
source: Ex: 41500
es: Ej: 41500

# offer_complete_name_text
source: Complete name
es: Nombre completo

# offer_example_email_text
source: example@gmail.com
es: ejemplo@empresa.com

# offer_offer_detaill_text
source: OFFER DATA
es: DATOS DE LA OFERTA

# offer_title_text
source: Title
es: Título

# offer_description_text
source: Description:
es: Descripción:

# offer_vacances_text
source: Vacancies
es: Vacantes

# offer_start_date_text
source: Start Date
es: Fecha Inicio

# offer_end_date_text
source: End Date
es: Fecha Fin

# offer_offer_type_text
source: Offer type
es: Tipo de oferta

# offer_select_text
source: Select
es: Selecciona

# offer_formation_text
source: Formation
es: Formación:

# offer_contact_detaill_text
source: CONTACT DETAILL
es: DATOS DE CONTACTO

# offer_addrees_text
source: Address
es: Dirección

# offer_postal_code_text
source: Postal code
es: Código postal

# offer_contact_name_text
source: Contact name
es: Nombre de contacto

# offer_contact_email_text
source: Contact email
es: Email de contacto

# offer_phone_text
source: Phone
es: Teléfono

# offer_optional_text
source: Optional
es: Opcional

# offer_mandatory_title_text
source: Title is required
es: Título obligatorio

# offer_mandatory_description_text
source: Description is required
es: Descripción obligatoria

# offer_mandatory_vacancy_text
source: Vacancies are required
es: Vacantes obligatorias

# offer_mandatory_cp_text
source: Postal code is required
es: Código postal obligatorio

# offer_mandatory_name_text
source: Name is required
es: Nombre obligatorio

# offer_mandatory_address_text
source: Address is required
es: Dirección obligatoria

# offer_phone_format_text
source: The phone number must be 9 digits
es: El número de teléfono ha de tener 9 digitos

# offer_mandatory_fields_text
source: Required fields
es: Campos obligatorios

# offer_fields_selected_text
source: Please check the marked fields
es: Por favor, revisa los campos marcados

# offer_required_type_text
source: Type is required
es: Tipo requerido

# offer_select_type_offer_text
source: Please select whether the offer is on-site or online
es: Selecciona si la oferta es presencial u online

# offer_required_degree_text
source: Degree is required
es: Grado requerido

# offer_select_degree_text
source: Please select a degree
es: Selecciona un grado de formación

# offer_required_dates_text
source: Dates are required
es: Fechas requeridas

# offer_offer_tab_text
source: Offers
es: Ofertas

# offer_max_length_vacances_text
source: You have exceeded the maximum allowed
es: Ha superado el máximo permitido

# offer_select_dates_text
source: You must select a start and end date
es: Debes seleccionar fechas de inicio a fin

# offer_invalid_postal_code_text
source: The postal code must be a five-digit number.
es: El código postal debe ser un número con cinco dígitos

# offer_invalid_date_text
source: Invalid dates
es: Fechas inválidas

# offer_error_dates_text
source: The start date cannot be after the end date
es: La fecha de inicio no puede ser posterior a la de fin

# offer_my_candidacy_text
source: My candidacy
es: Mis candidaturas

# offer_success_text
source: Success
es: Éxito

# offer_succefully_offer_text
source: Offer created successfully
es: Oferta creada correctamente

# offer_detail_screen_title_text
source: Detail
es: Detalle

# offer_create_offer_text
source: Create offer
es: Crear oferta

# offer_type_regular_text
source: Standard program
es: Régimen ordinario

# offer_type_adults_text
source: Adult education program
es: Régimen personas adultas

# offer_type_unknown_text
source: Unknown type
es: Régimen desconocido

# offer_detail_load_error_text
source: Failed to load the offer. Please try again.
es: No se pudo cargar la oferta. Inténtalo de nuevo.

# error_no_internet_text
source: No internet conection
es: No hay conexion a internet

# error_session_expired_text
source: Sesion expired
es: Tu sesión ha expirado

# error_if_exist_name_text
source: There is already a company with that name
es: Ya exite una empresa con ese nombre

# error_if_invalid_date_text
source: Invalid dates
es: Los datos no son validos

# error_unknow_error_text
source: Unknow server error
es: Error desconocido del servidor

# offer_list_open_text
source: Opened
es: Abiertas

# offer_list_close_text
source: Closed
es: Cerradas

# offer_list_no_offers_text
source: No offers available.
es: No hay ofertas disponibles.

# offer_list_my_offers_text
source: My offers
es: Mis ofertas

# offer_list_active_text
source: Active
es: Activa

# offer_list_offer_list_nav_text
source: Offer list
es: Lista de ofertas

# offer_list_date_offer_text
source: Date:
es: Fecha:

# offer_list_closed_text
source: Closed
es: Cerrada

# offer_list_formation_text
source: Formation:
es: Formación:

# offer_list_vacancies_text
source: Vacancy:
es: Vacantes:

# offer_list_modality_text
source: Mode:
es: Modalidad:

# offer_list_watchers_text
source: visualizations:
es: Visualizaciones:

# offer_list_inscribe_text
source: Already registered
es: Ya inscrito

# offer_list_company_text
source: Company:
es: Empresa:

# offer_list_address_text
source: Address:
es: Dirección:

# offer_list_postal_code_text
source: Postal code:
es: Código postal:

# offer_list_contact_text
source: Contact:
es: Contacto:

# offer_list_phone_text
source: Phone:
es: Telefono:

# offer_list_not_offer_text
source: the offer could not be loaded
es: No se pudo cargar la oferta

# offer_list_register_text
source: Register
es: Inscribirse

# offer_list_icon_description_text
source: Company logo
es: Logo de la empresa

# offer_list_icon_inscribe_text
source: Inscribe logo
es: Icono de Inscripción

# offer_list_next_text
source: Next
es: Siguiente

# offer_list_previous_text
source: Previous
es: Anterior

# components_sample_title_text
source: Components
es: Componentes

# components_sample_menu_buttons_button
source: Buttons
es: Botones

# components_sample_menu_dialogs_button
source: Dialogs
es: Dialogos

# components_sample_menu_pickers_button
source: Pickers
es: Selectores

# components_sample_menu_sign_up_example_button
source: Sign up example
es: Ejemplo de registro

# components_sample_buttons_primary_text
source: Primary
es: Primario

# components_sample_buttons_tertiary_text
source: Tertiary
es: Terciario

# components_sample_buttons_outlined_text
source: Secondary button
es: Botón secundario

# components_sample_buttons_enabled_button
source: Button
es: Botón

# components_sample_buttons_disabled_button
source: Disabled
es: Deshabilitado

# components_sample_buttons_icon_button
source: Icon
es: Icono

# components_sample_textfields_default_label
source: Default textField
es: TextField básico

# components_sample_textfields_error_label
source: Error textField
es: TextField con error

# components_sample_textfields_number_label
source: Number TextField
es: TextField numérico

# components_sample_textfields_number_placeholder
source: e.g. 1234
es: ej. 1234

# components_sample_textfields_disabled_label
source: Disabled textField
es: TextField deshabilitado

# components_sample_textfields_trailing_icon_label
source: Trailing icon textField
es: TextField con icono

# components_sample_textfields_password_label
source: Password textField
es: Contraseña

# components_sample_textfields_suggestions_label
source: TextField with suggestions
es: TextField con sugerencias

# components_sample_dialogs_info_dialog_title_text
source: Info dialog
es: Informativo

# components_sample_dialogs_info_dialog_message_text
source: Info dialog message
es: Mensaje del diálogo informativo

# components_sample_dialogs_error_dialog_title_text
source: Error dialog
es: Error

# components_sample_dialogs_error_dialog_message_text
source: Error dialog message
es: Mensaje del diálogo de error

# components_sample_dialogs_warning_dialog_title_text
source: Warning dialog
es: Advertencia

# components_sample_dialogs_warning_dialog_message_text
source: Warning dialog message
es: Mensaje del diálogo de advertencia

# components_sample_dialogs_input_text_dialog_title_text
source: Input dialog
es: Entrada de texto

# components_sample_dialogs_input_text_dialog_message_text
source: Input text dialog message
es: Mensaje del diálogo con entrada de texto

# components_sample_dialogs_input_text_dialog_placeholder
source: Write here
es: Escribe aquí

# components_sample_dialogs_input_text_dialog_snackbar
source: Text is: {text}
es: El texto es: {text}

# components_sample_picker_title_text
source: Pickers
es: Selectores

# components_sample_picker_header_text
source: Dates
es: Fechas

# components_sample_picker_birth_date_text
source: Birthdate
es: Fecha de nacimiento

# components_sample_picker_day_text
source: Day
es: Día

# components_sample_picker_time_text
source: Time
es: Hora

# components_sample_picker_hidden_with_check_text
source: Studies completed
es: Estudios finalizados

# components_sample_picker_gender_text
source: Gender
es: Género

# components_sample_picker_gender_options_header_text
source: Select your gender
es: Selecciona tu género

# components_sample_picker_list_with_search_text
source: Picker with search
es: Selector con buscador

# components_sample_picker_placeholder_text
source: Select
es: Selecciona

# components_sample_picker_list_text
source: Select the most beautiful city
es: Selecciona la ciudad más bonita

# components_sample_picker_multiple_choice_text
source: Multiple choice
es: Multiselección

# components_sample_picker_single_choice_text
source: Single choice
es: Selección única

# components_sample_picker_inline_text
source: Picker Inline
es: Selector "inline"

# components_sample_picker_wheel_text
source: Wheel
es: Rueda
